package com.naumovets.interview.preparation.homeWork_4;

public class HomeWorkApplication {
    public static void main(String[] args) {
        //=====================================================
        // Задание 1.
        //=====================================================

        /*
         Задание реализовано в пекедже task_1.

         Комментарии:
         * В пекедже task_1 содержится файл query.sql в котором содержатся все необходимые запросы к бд согласно заданию,
         а также скрины запросов.
        */
    }
}
